{
  "title": "Pumpkin-Shaped Pumpkin Bread",
  "difficulty": "Intermediate",
  "author": "Food Network",
  "thumbnail": "../images/pumpkin-bread.jpeg",
  "contentSource": "https://www.foodnetwork.com/recipes/food-network-kitchen/pumpkin-shaped-pumpkin-bread-8849742",
  "recipe-time": [40, 89, 129],
  "yield": "1 loaf",
  "ingredientsList": {
    "bread": [
      {
        "amount": "1/4 cup",
        "name": "whole milk",
        "direction": "warmed to 110 degrees F"
      },
      { "amount": "Two 1/4-ounce packets", "ingredient": "active-dry yeast" },
      { "amount": "3/4 cup", "name": "pure pumpkin puree" },
      { "amount": "1/4 cup packed", "name": "light brown sugar" },
      { "amount": "2", "name": "large eggs" },
      {
        "amount": "1 tablespoon",
        "name": "vegetable oil",
        "direction": "plus more for greasing the bowl"
      },
      {
        "amount": "3 cups",
        "name": "all-purpose flour",
        "direction": "plus more for dusting (see Cook's Note)"
      },
      { "amount": "1 teaspoon", "name": "ground cinnamon" },
      { "amount": "1 teaspoon", "name": "kosher salt" },
      { "amount": "1", "name": "cinnamon stick" }
    ],
    "spicedPumpkinButter": [
      { "amount": "1 cup", "name": "pure pumpkin puree" },
      { "amount": "1/3 cup", "name": "heavy cream" },
      { "amount": "1/4 cup", "name": "packed light brown sugar" },
      { "amount": "2 tablespoons", "name": "maple syrup" },
      { "amount": "1 teaspoon", "name": "ground cinnamon" },
      { "amount": "A pinch of", "name": "Kosher salt" }
    ]
  },
  "utensilsCookware": {
    "utensils": ["pumpkin-shaped bread mould", "kitchen twine"]
  },
  "instructions": {
    "step": [
      "For the pumpkin bread: Pour the warm milk into a large bowl and sprinkle the yeast over top. Let the yeast activate until foamy, about 5 minutes. Whisk in the pumpkin puree, brown sugar, 1 large egg and the oil until smooth. Whisk together the flour, ground cinnamon and salt in a separate bowl, then stir into the pumpkin mixture until a shaggy ball forms.",
      "Lightly dust a work surface with flour. Turn out the dough and knead until very smooth and elastic, about 10 minutes. Transfer to another large bowl lightly greased with oil. Cover tightly with plastic wrap and let rise in a warm place until doubled in size, 1 hour to 1 hour 15 minutes.",
      "Line a rimmed baking sheet with parchment paper. Punch down the dough, then reroll it into a smooth ball about 6 inches wide. Cut three 24-inch-long pieces of kitchen twine and lay them on a clean work surface, crisscrossing at the center to create a star-shaped pattern. Place the ball of dough in the center, then tie the ends of the twine up over the dough and secure in a knot, leaving about 1 inch of space between the dough and knot so it has room to proof and expand. Do not tie the twine too tightly. Transfer to the prepared baking sheet, insert the cinnamon stick in the center of the dough for the stem. Cover loosely with plastic wrap and let rise until the kitchen twine has tightened and the dough is starting to take the shape of a pumpkin, 15 to 30 minutes more.",
      "While the dough is rising, preheat the oven to 350 degrees F.",
      "Whisk the remaining egg with 1 teaspoon water in a small bowl, then brush over the entire exterior of the bread with a pastry brush. Bake until well browned and an instant-read thermometer registers 190 degrees F at the center, about 30 minutes. Cool completely on a wire rack. ",
      "For the spiced pumpkin butter: Combine the pumpkin puree, heavy cream, brown sugar, maple syrup, cinnamon and a pinch of salt in a small saucepan over medium-low heat. Cook, stirring frequently, until the sugar melts and the mixture thickens slightly and turns a deep orange color, about 10 minutes. Transfer to a bowl and refrigerate until chilled.",
      "Carefully cut and remove the kitchen twine from the bread. Cut into slices and serve with the spiced pumpkin butter."
    ]
  }
}
